Revit 2027 API
IExternalService Interface
 The base interface class for all external services.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IExternalService
Public Interface IExternalService
public interface class IExternalService
type IExternalService = interface end
The IExternalService type exposes the following members.
Methods
Name | Description
Execute |  Implement this method to execute the given server.
GetDescription |  Implement this method to return a description of the service.
GetName |  Implement this method to return the name of the service.
GetServiceId |  Implement this method to return the unique Id of the service.
GetVendorId |  Implement this method to return the vendor Id of the service.
IsValidServer |  Implement this method to check if the given instance represents a valid server of this service.
OnServersChanged |  Implement this method to handle situations when servers for the service have changed.
OnServersDisparity |  Implements this method to get notified that the servers in a just opened document differ from those currently set as active for the service.
Top
Remarks
 Both supported kinds of services - single-server and multi-server - will derive their classes from this interface, albeit indirectly through an interface specific to the particular kind. External services never derive directly from this class - they always have to derive from either ISingleServerService or IMultiServerService, respectivelly.
See Also
Reference
Autodesk.Revit.DB.ExternalService Namespace